20210829200955-obs.org
:PROPERTIES:
:ID:       d29202e8-f21c-41e0-9ddf-bad77a01de6a
:END:
#+title: OBS
* 概要
OBSは動画録画/加工をするプログラム。主に[[id:656a0aa4-e5d3-416f-82d5-f909558d0639][C言語]]で書かれている。スクリーンを録画しつつ右下には自分の顔を表示する、ようなこと(ワイプ)が簡単にできる。保存するだけでなく、出力を選択してYouTubeでキャストしたり、Google Meetで使用したりもできる。

- repository :: https://github.com/obsproject/obs-studio
* Memo
** フォント設定
高DPIのディスプレイを使っていると、フォントが豆粒になるので大きくして起動する。
#+begin_src shell
$ QT_SCALE_FACTOR=2 obs
#+end_src
Nvidiaのドライバーがどうのとエラーが出るので、使わない設定にした。
* Tasks
* Archives
* Reference
