20210829200955-obs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-15 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OBS</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">OBS</h1>
<div id="outline-container-orgb391365" class="outline-2">
<h2 id="orgb391365"><a href="#orgb391365">概要</a></h2>
<div class="outline-text-2" id="text-orgb391365">
<p>
OBSは動画録画/加工をするプログラム。主に<a href="20210911104632-c_language.html#ID-656a0aa4-e5d3-416f-82d5-f909558d0639">C言語</a>で書かれている。スクリーンを録画しつつ右下には自分の顔を表示する、ようなこと(ワイプ)が簡単にできる。保存するだけでなく、出力を選択してYouTubeでキャストしたり、Google Meetで使用したりもできる。
</p>

<dl class="org-dl">
<dt>repository</dt><dd><a href="https://github.com/obsproject/obs-studio">https://github.com/obsproject/obs-studio</a></dd>
</dl>
</div>
</div>
<div id="outline-container-org58e4c5d" class="outline-2">
<h2 id="org58e4c5d"><a href="#org58e4c5d">Memo</a></h2>
<div class="outline-text-2" id="text-org58e4c5d">
</div>
<div id="outline-container-orgea80a23" class="outline-3">
<h3 id="orgea80a23"><a href="#orgea80a23">フォント設定</a></h3>
<div class="outline-text-3" id="text-orgea80a23">
<p>
高DPIのディスプレイを使っていると、フォントが豆粒になるので大きくして起動する。
</p>
<div class="org-src-container">
<pre class="src src-shell">$ <span class="org-variable-name">QT_SCALE_FACTOR</span>=2 obs
</pre>
</div>
<p>
Nvidiaのドライバーがどうのとエラーが出るので、使わない設定にした。
</p>
</div>
</div>
</div>
<div id="outline-container-org37bf3e0" class="outline-2">
<h2 id="org37bf3e0"><a href="#org37bf3e0">Tasks</a></h2>
</div>
<div id="outline-container-org72f68de" class="outline-2">
<h2 id="org72f68de"><a href="#org72f68de">Archives</a></h2>
</div>
<div id="outline-container-org40c2e08" class="outline-2">
<h2 id="org40c2e08"><a href="#org40c2e08">Reference</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
